In [2]:
import pandas as pd
import numpy as np

C:\Users\YOSSI\AppData\Roaming\Python\Python310\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [3]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

)

In [4]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [5]:
df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [8]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
df.index.isin([0,2,4])

array([ True, False,  True, False])

In [9]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]},

    index=["foo", "bar", "boo", "kar"],

)

In [10]:
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [11]:
df.loc["bar":"kar"]  # Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [12]:
df[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [13]:
df["bar":"kar"]

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [14]:
data = {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

In [15]:
data

{'AAA': [4, 5, 6, 7], 'BBB': [10, 20, 30, 40], 'CCC': [100, 50, -30, -50]}

In [16]:
df2 = pd.DataFrame(data=data, index=[1, 2, 3, 4])  # Note index starts at 1.

In [19]:
df2.iloc[1:3]  # Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [20]:
df2.loc[1:3]

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [21]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

)

In [22]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [23]:
df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [25]:
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})

In [26]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [27]:
source_cols = df.columns  # Or some subset would work too

In [28]:
source_cols

Index(['AAA', 'BBB', 'CCC'], dtype='object')

In [29]:
new_cols = [str(x) + "_cat" for x in source_cols]

In [30]:
new_cols

['AAA_cat', 'BBB_cat', 'CCC_cat']

In [31]:
categories = {1: "Alpha", 2: "Beta", 3: "Charlie"}

In [34]:
categories.get

In [32]:
df[new_cols] = df[source_cols].map(categories.get)

In [33]:
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [57]:
df = pd.DataFrame(

    {"AAA": [1, 1, 1, 2, 2, 2, 3, 3], "BBB": [2, 1, 3, 4, 5, 1, 2, 3]}

)

In [36]:
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [37]:
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [38]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

In [41]:
df.sort_values(by="BBB").groupby("AAA").first()

     BBB
AAA
1      1
2      1
3      2

In [65]:
df = pd.DataFrame(

    {

        "row": [0, 1, 2],

        "One_X": [1.1, 1.1, 1.1],

        "One_Y": [1.2, 1.2, 1.2],

        "Two_X": [1.11, 1.11, 1.11],

        "Two_Y": [1.22, 1.22, 1.22],

    }

)

df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [66]:
df = df.set_index("row")

In [67]:
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [68]:
df.columns = pd.MultiIndex.from_tuples([tuple(c.split("_")) for c in df.columns])

In [69]:
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [70]:
df.loc[0, "One"]

X    1.1
Y    1.2
Name: 0, dtype: float64

In [71]:
df1 = df.stack(0, future_stack=True)

In [72]:
df1

            X     Y
row
0   One  1.10  1.20
    Two  1.11  1.22
1   One  1.10  1.20
    Two  1.11  1.22
2   One  1.10  1.20
    Two  1.11  1.22

In [73]:
df2 = df.stack(0, future_stack=True).reset_index(1)

In [74]:
df2

    level_1     X     Y
row
0       One  1.10  1.20
0       Two  1.11  1.22
1       One  1.10  1.20
1       Two  1.11  1.22
2       One  1.10  1.20
2       Two  1.11  1.22

In [76]:
df2.columns = ["Sample", "All_X", "All_Y"]

In [77]:
df2

    Sample  All_X  All_Y
row
0      One   1.10   1.20
0      Two   1.11   1.22
1      One   1.10   1.20
1      Two   1.11   1.22
2      One   1.10   1.20
2      Two   1.11   1.22

In [79]:
cols = pd.MultiIndex.from_tuples(

    [(x, y) for x in ["A", "B", "C"] for y in ["O", "I"]]

)
cols

MultiIndex([('A', 'O'),
            ('A', 'I'),
            ('B', 'O'),
            ('B', 'I'),
            ('C', 'O'),
            ('C', 'I')],
           )

In [83]:
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)
df

          A                   B                   C
          O         I         O         I         O         I
n  1.484159 -0.670921  0.885872 -0.885626 -0.214065  0.744394
m -0.836786  1.305883  0.013152  0.310739  0.850121 -0.316568

In [84]:
df1 = df.div(df["C"], level=1)
df1

          A                   B              C
          O         I         O         I    O    I
n -6.933207 -0.901299 -4.138328 -1.189728  1.0  1.0
m -0.984314 -4.125125  0.015470 -0.981585  1.0  1.0

In [85]:
#misalignment
df2 = df.div(df["C"], level=0)
df2

    A       B       C
    O   I   O   I   O   I
n NaN NaN NaN NaN NaN NaN
m NaN NaN NaN NaN NaN NaN

In [88]:
df1['A']

          O         I
n -6.933207 -0.901299
m -0.984314 -4.125125

In [89]:
df1[('A', 'O')]

n   -6.933207
m   -0.984314
Name: (A, O), dtype: float64

In [90]:
df1.loc[:, ('A', 'O')]

n   -6.933207
m   -0.984314
Name: (A, O), dtype: float64

In [91]:
df1.loc["m", ('A', 'O')]

-0.9843140687213755

In [92]:
df1.loc[:, 'A']

          O         I
n -6.933207 -0.901299
m -0.984314 -4.125125

In [93]:
df1.loc["n", 'A']

O   -6.933207
I   -0.901299
Name: n, dtype: float64

In [94]:
df.xs('O', axis=1, level=1)  # Selects all 'O' subcolumns across all top-level columns

          A         B         C
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [99]:
df.loc[:, (slice(None), "O")]

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [107]:
idx = pd.IndexSlice
idx['A':'C', 'O']

(slice('A', 'C', None), 'O')

In [104]:
idx = pd.IndexSlice
df.loc[:, idx['A':'C', 'O']]  # Selects 'O' subcolumns for A and B

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [113]:
idx = pd.IndexSlice
df.loc[:, (slice('A', 'C'), 'O')]

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [115]:
coords = [("AA", "one"), ("AA", "six"), ("BB", "one"), ("BB", "two"), ("BB", "six")]
coords

[('AA', 'one'), ('AA', 'six'), ('BB', 'one'), ('BB', 'two'), ('BB', 'six')]

In [116]:
index = pd.MultiIndex.from_tuples(coords)

In [133]:
df = pd.DataFrame([11, 22, 33, 44, 55], index, ["MyData"])
df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [148]:
df.xs("BB", level=0, axis=0)

     MyData
one      33
two      44
six      55

In [150]:
df.xs("six", level=1, axis=0)

    MyData
AA      22
BB      55

In [135]:
#Selecting a single level
result = df.xs('AA')
result

     MyData
one      11
six      22

In [136]:
result = df.xs(('BB', 'two'))
result

MyData    44
Name: (BB, two), dtype: int64

In [137]:
# Select all rows where the second level is 'one'
result = df.xs('one', level=1)
result

    MyData
AA      11
BB      33

In [138]:
result = df.xs('AA', drop_level=False)
result

        MyData
AA one      11
   six      22

In [140]:
# Select all rows from 'AA' to 'BB' (inclusive)
result = df.loc[(slice('AA', 'BB'), slice(None))]
result

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [142]:
# If we had multiple columns, we could select a specific one
# For this example, we'll just demonstrate the syntax
result = df.xs('AA')['MyData']
result

one    11
six    22
Name: MyData, dtype: int64

In [144]:
# Select rows where 'MyData' > 30 for the first level 'BB'
result = df.xs('BB')[df.xs('BB')['MyData'] > 30]
result

     MyData
one      33
two      44
six      55